# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 129 layers, 3157200 parameters, 3157184 gradients, 8.9 GFLOPS
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 129 layers, 11166560 parameters, 11166544 gradients, 28.8 GFLOPS
  m: [0.67, 0.75, 768] # YOLOv8m summary: 169 layers, 25902640 parameters, 25902624 gradients, 79.3 GFLOPS
  l: [1.00, 1.00, 512] # YOLOv8l summary: 209 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPS
  x: [1.00, 1.25, 512] # YOLOv8x summary: 209 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPS

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Involution, [64, 7, 2]]   # P1/2            0
  - [-1, 1, Involution, [128, 7, 2]]  # P2/4            1
  - [-1, 3, C2f, [128, True]]   #                 2
  - [-1, 1, Involution, [256, 7, 2]]  # P3/8            3
  - [-1, 6, C2f, [256, True]]   #                 4
  - [-1, 1, Involution, [512, 7, 2]]  # P4/16           5
  - [-1, 6, C2f, [512, True]]   #                 6
  - [-1, 1, Involution, [1024, 7, 2]] # P5/32           7
  - [-1, 3, C2f, [1024, True]]  #                 8
  - [-1, 1, SPPF, [1024, 5]]    #                 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None,2, 'nearest']]  #         10
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4          11
  - [-1, 3, C2f, [512]]  #                               12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #         13
  - [[ -1, 4], 1, Concat, [1]] # cat backbone P3         14
  - [-1, 3, C2f, [256]]  # (P3/8-small)                  15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #         16
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P2         17
  - [-1, 3, C2f, [128]]  # (P2/4-xsmall)                 18

  - [-1, 1, Conv, [128, 3, 2]] #                         19
  - [[-1, 15], 1, Concat, [1]] # cat head P3             20
  - [-1, 3, C2f, [256]] # (P3/8-small)                   21

  - [-1, 1, Conv, [256, 3, 2]] #                         22
  - [[-1, 12], 1, Concat, [1]]  # cat head P4            23
  - [-1, 3, C2f, [512]]  # (P4/16-medium)                24

  - [-1, 1, Conv, [512, 3, 2]] #                         26
  - [[-1, 9], 1, Concat, [1]]  # cat head P5             27
  - [-1, 3, C2f, [1024]]  #    (P5/32-large)             28

  - [[19, 21, 24, 27], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
